simulations/pisofoam_cases/3_branch_one_main_pair/case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.00754;

boundaryField
{
    wall
    {
        type            epsilonWallFunction;
        value           uniform 0.00754;
    }
    surfaces
    {
        type            epsilonWallFunction;
        value           uniform 0.00754;
    }
    main_inlet
    {
        type            slip;
    }
    main_outlet
    {
        type            slip;
    }
    branch_inlet
    {
        type            slip;
    }
    branch_outlet
    {
        type            slip;
    }

}

// ************************************************************************* //
