simulations/pisofoam_cases/3_branch_one_main_pair/case/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 22.4;

boundaryField
{
    wall
    {
        type            omegaWallFunction;
        value           uniform 22.4;
    }
    surfaces
    {
        type            omegaWallFunction;
        value           uniform 22.4;
    }
    main_inlet
    {
        type            slip;
    }
    main_outlet
    {
        type            slip;
    }
    branch_inlet
    {
        type            slip;
    }
    branch_outlet
    {
        type            slip;
    }
}


// ************************************************************************* //
